/*
 * @Author: your name
 * @Date: 2021-12-15 15:37:06
 * @LastEditTime: 2021-12-15 20:27:12
 * @LastEditors: Please set LastEditors
 * @Description: 打开koroFileHeader查看配置 进行设置: https://github.com/OBKoro1/koro1FileHeader/wiki/%E9%85%8D%E7%BD%AE
 * @FilePath: \hubulidere:\素材\【HTML+CSS+VUE】：选择城市\Vue\js\index.js
 */
Vue.config.productionTip = false //阻止vue在启动时生成生产提示

const app = new Vue({
    el: '#app',
    data: {
        hot: [
            '北京', '三亚', '上海', '香港', '厦门',
            '成都', '广州', '杭州', '重庆',
        ],
        City: [{
                capital: 'A',
                name: [
                    '阿城', '安达', '安图', '鞍山', '阿鲁旗', '敖汉', '阿巴嘎', '阿荣旗',
                    '阿尔山', '阿左旗', '阿右旗', '安新', '安国', '安平', '安泽', '安塞', '安康',
                    '安丘', '阿拉尔', '阿克苏', '阿瓦提', '阿勒泰', '阿图什', '阿克陶', '阿合奇',
                    '阿拉山口', '定日', '昂仁', '安多', '阿里', '安定', '阿克塞', '安阳', '安陆',
                    '安吉', '安庆', '安溪', '安义', '乐安', '安福', '安远县', '安源', '安仁', '安乡',
                    '安化', '安顺', '安龙', '安县', '安岳', '阿坝', '安宁', '都安', '澳门'
                ]
            },
            {
                capital: 'B',
                name: [
                    '北京', '宝山', '宝坻', '北辰', '滨海新区', '北碚', '巴南', '璧山', '宾县',
                    '巴彦', '拜泉', '北安', '勃利', '宝清', '白城', '白山', '本溪', '本溪县',
                    '北镇', '北票', '包头', '白云鄂博', '巴雅尔吐胡硕', '巴林左旗', '巴林右旗',
                    '八里罕', '宝国吐', '博克图', '保定', '博野', '霸州', '泊头', '柏乡',
                    '北戴河', '保德', '彬县', '白水', '白河', '宝鸡', '博山', '滨州', '博兴',
                    '白杨沟', '白碱滩', '巴音布鲁克', '博湖', '巴仑台', '拜城', '巴楚', '巴里坤',
                    '布尔津', '博乐', '白朗', '波密', '边坝', '八宿', '班戈', '巴青', '比如',
                    '班玛', '白银', '宝丰', '博爱', '泌阳', '宝应', '滨海', '保康', '巴东',
                    '北仑', '蚌埠', '亳州', '保靖', '白云', '毕节', '北川县', '巴中', '布拖',
                    '宝兴', '白玉', '巴塘', '博罗', '宾川', '保山', '宾阳', '博白', '北流',
                    '百色', '巴马', '北海', '白沙', '保亭'
                ]
            },
            {
                capital: 'C',
                name: [
                    '朝阳', '昌平', '崇明', '重庆', '长寿', '城口', '长春', '长岭', '长白', '长海',
                    '昌图', '朝阳市', '察右前旗', '察右中旗', '察右后旗', '赤峰', '陈旗', '赤城',
                    '崇礼', '承德', '承德县', '曹妃甸', '沧州', '沧县', '成安', '磁县', '昌黎',
                    '长治', '长安', '淳化', '长武', '澄城', '城固', '陈仓', '长清', '长岛', '昌乐',
                    '昌邑', '曹县', '成武', '成山头', '茌平', '昌吉', '蔡家湖', '察布查尔', '策勒',
                    '错那', '措美', '察隅', '昌都', '察雅', '措勤', '称多', '崇信', '成县', '长垣',
                    '长葛', '常熟', '常州', '蔡甸', '赤壁', '崇阳', '长阳', '淳安', '长兴', '慈溪',
                    '苍南', '常山', '长丰', '巢湖', '滁州', '池州', '长乐', '城厢', '崇武', '长泰',
                    '长汀', '崇仁', '崇义', '长沙', '茶陵', '常宁', '郴州', '常德', '城步', '慈利',
                    '辰溪', '赤水', '长顺', '岑巩', '从江', '册亨', '成都', '崇州', '长宁', '苍溪',
                    '从化', '潮阳', '澄海', '赤坎', '潮州', '潮安', '呈贡', '昌宁', '澄江', '楚雄',
                    '沧源', '崇左', '苍梧', '岑溪', '澄迈', '昌江'
                ]
            },
            {
                capital: 'D',
                name: [
                    '大兴', '东丽', '大港', '垫江', '大足', '东宁', '大兴安岭', '大庆', '杜尔伯特', '德惠',
                    '敦化', '大安', '东丰', '东辽', '东岗', '大连', '丹东', '东港', '大石桥', '灯塔',
                    '调兵山', '大洼', '达茂旗', '达拉特', '东胜', '磴口', '大佘太', '东乌旗', '多伦',
                    '定州', '定兴', '大城', '大厂', '东光', '大名', '大同', '大同县', '大宁', '定襄',
                    '代县', '定边', '大荔', '丹凤', '德州', '东平', '东明', '定陶', '东营', '东阿', '达坂城',
                    '当雄', '堆龙德庆', '达孜', '定结', '丁青', '大通', '达日', '多县', '德令哈', '大柴旦',
                    '都兰', '定西', '敦煌', '宕昌', '东乡', '迭部', '登封', '邓州', '郸城', '丹阳', '丹徒',
                    '东台', '大丰', '东海', '东西湖', '大悟', '大冶', '当阳', '丹江口', '掇刀', '德清', '洞头',
                    '东阳', '当涂岱山', '定海', '', '砀山', '定远', '东至', '德化', '东山', '大田', '钓鱼岛',
                    '德安', '都昌', '德兴', '东乡县', '大余', '定南', '洞口', '东安', '道县', '道真', '都匀',
                    '独山', '丹寨', '德江', '大方', '大邑', '都江堰', '达州', '大竹', '达县', '东兴', '丹棱',
                    '德昌 ', '丹巴', '道孚', '德格', '稻城', '得荣', '德阳', '大埔', '斗门', '德庆', '东源',
                    '东莞', '电白', '东川', '大理', '大姚', '大关', '德钦', '德宏', '大新', '德保', '东兰',
                    '大化', '东兴市', '东方', '儋州', '定安', '氹仔岛'
                ]
            },
            {
                capital: 'E',
                name: [
                    '鄂尔多斯', '鄂前旗', '鄂托克', '二连浩特', '鄂伦春旗', '鄂温克旗',
                    '额尔古纳', '额济纳', '额敏', '鄂州', '恩施', '峨边', '峨眉', '峨眉山',
                    '恩平', '洱源', '峨山'
                ]
            },
            {
                capital: 'F',
                name: [
                    '丰台', '房山', '奉贤', '涪陵', '奉节', '丰都', '方正', '富裕', '抚远', '富锦',
                    '扶余', '抚松', '法库', '抚顺', '凤城', '阜新', '丰镇', '阜平', '丰宁', '丰南',
                    '丰润', '阜城', '峰峰', '肥乡', '抚宁', '汾西', '浮山', '繁峙', '方山', '汾阳',
                    '富县', '府谷', '富平', '佛坪', '凤翔', '扶风', '凤县', '福山', '肥城', '费县',
                    '阜康', '福海', '富蕴', '封丘', '方城', '范县', '扶沟', '阜宁', '丰县', '房县',
                    '富阳', '奉化', '肥东', '肥西', '繁昌', '凤台县', '阜阳', '阜南', '凤阳', '福州',
                    '福清', '福安', '福鼎', '抚州', '奉新', '丰城', '浮梁', '分宜', '凤凰', '凤冈',
                    '福泉', '富顺', '丰顺', '佛山', '封开', '佛冈', '富民', '富源', '富宁', '凤庆',
                    '福贡', '扶绥', '富川', '凤山', '防城港', '防城'
                ]
            },
            {
                capital: 'G',
                name: [
                    '甘南', '公主岭', '盖州', '弓长岭', '固阳', '岗子', '根河', '高力板',
                    '拐子湖', '高邑', '藁城', '高阳', '高碑店', '沽源', '固安', '故城',
                    '广宗', '广平', '馆陶', '古交', '广灵', '高平', '古县', '高陵', '甘泉',
                    '高青', '高密', '广饶', '冠县', '高唐', '巩留', '岗巴', '贡嘎', '工布江达',
                    '贡觉', '改则', '噶尔', '革吉', '贵德', '贵南', '共和', '果洛', '甘德',
                    '刚察', '格尔木', '皋兰', '古浪', '高台', '瓜州', '甘谷', '广河', '固原',
                    '巩义', '光山', '固始', '高淳', '高邮', '赣榆', '灌云', '灌南', '谷城',
                    '公安', '广水', '固镇', '涡阳', '广德', '古田', '光泽', '广丰', '广昌',
                    '高安', '赣州', '赣县', '贵溪', '桂阳', '桂东', '古丈', '贵阳', '关岭',
                    '贵定', '广安', '古蔺', '高县', '珙县', '甘洛', '甘孜', '广汉', '广元',
                    '广州', '高明', '广宁', '高要', '高州', '个旧', '广南', '耿马', '贡山',
                    '桂林', '灌阳', '恭城', '贵港', '桂平', '高雄'
                ]
            },
            {
                capital: 'H',
                name: [
                    '海淀', '怀柔', '汉沽', '合川', '哈尔滨', '呼兰', '海林', '桦川', '桦南',
                    '海伦', '黑河', '呼玛', '呼中区', '虎林', '鹤岗', '桦甸', '和龙', '龙井',
                    '辉南', '海城', '桓仁', '葫芦岛', '呼和浩特', '和林', '化德', '霍林郭勒',
                    '浩尔吐', '河南乡', '杭锦旗', '海力素', '杭锦后旗', '海拉尔', '胡尔勒',
                    '怀安', '怀来', '海兴', '黄骅', '河间', '衡水', '邯郸', '浑源', '和顺',
                    '壶关', '洪洞', '霍州', '侯马', '河津', '怀仁', '河曲', '户县', '黄陵',
                    '黄龙', '横山', '华县', '合阳', '韩城', '华阴', '汉阴', '汉中', '黄岛',
                    '桓台', '海阳', '菏泽', '惠民', '河口市', '呼图壁', '和静', '霍城', '霍尔果斯',
                    '和布克赛尔', '哈密', '和田', '哈巴河', '湟源', '湟中', '互助', '化隆', '黄南',
                    '河南县', '海南州', '海北', '海晏', '华亭', '环县', '华池', '合水', '徽县', '和政',
                    '合作', '会宁', '贺兰', '惠农', '海原', '滑县', '获嘉', '辉县', '淮滨', '潢川',
                    '鹤壁', '淮阳', '海安', '海门', '邗江', '淮安', '洪泽', '淮阴区', '淮安区', '黄陂',
                    '汉川', '黄冈', '红安', '黄梅', '黄石', '洪湖', '鹤峰', '杭州', '湖州', '海宁',
                    '海盐', '洪家', '黄岩', '合肥', '怀远', '淮南', '含山', '和县', '怀宁', '黄山市',
                    '黄山区', '黄山风景区', '淮北', '霍邱', '霍山', '涵江', '惠安', '华安', '湖口',
                    '横峰', '会昌', '衡阳', '衡山', '衡东', '衡阳县', '衡南', '汉寿', '赫山区', '华容',
                    '怀化', '会同', '洪江', '花垣', '花溪', '汇川', '红花岗', '惠水', '黄平', '赫章',
                    '华蓥', '合江', '洪雅', '会理', '会东', '汉源', '黑水', '红原', '花都', '惠州',
                    '惠阳', '惠东', '怀集', '鹤山', '河源', '和平', '惠来', '化州', '海丰', '鹤庆',
                    '红河', '河口县', '会泽', '华宁', '华坪', '横县', '合山', '贺州', '河池', '环江',
                    '合浦', '海口', '花莲'
                ]
            },
            {
                capital: 'J',
                name: [
                    '嘉定', '金山', '静海', '津南', '蓟县', '江津', '佳木斯', '加格达奇',
                    '嘉荫', '鸡西', '鸡东', '集贤', '九台', '吉林', '蛟河', '集安', '靖宇',
                    '江源', '金州', '锦州', '建昌', '集宁', '吉兰太', '井陉', '晋州', '景县',
                    '冀州', '巨鹿', '鸡泽', '尖草坪区', '晋中', '介休', '晋城', '吉县', '稷山',
                    '绛县', '静乐', '交口', '交城', '泾阳', '佳县', '靖边', '清涧', '济南',
                    '济阳', '即墨', '胶州', '济宁', '嘉祥', '金乡', '莒南', '鄄城', '巨野',
                    '莒县', '吉木萨尔', '伽师', '吉木乃', '精河', '江孜', '吉隆', '加查', '江达',
                    '嘉黎', '尖扎', '久治', '泾川', '静宁', '金昌', '酒泉', '金塔', '积石山',
                    '靖远', '景泰', '嘉峪关', '泾源', '郏县', '吉利', '焦作', '济源', '江宁',
                    '江浦', '江阴', '句容', '江都', '建湖', '金湖', '金坛', '姜堰', '靖江', '江夏',
                    '嘉鱼', '荆州', '江陵', '监利', '建始', '荆门', '京山', '建德', '嘉兴', '嘉善',
                    '椒江', '缙云', '景宁', '金华', '江山', '界首', '泾县', '旌德', '绩溪', '金寨',
                    '九华山', '晋江', '将乐', '建宁', '建阳', '建瓯', '进贤', '九江', '金溪', '靖安',
                    '吉安', '吉安县', '吉水', '井冈山', '景德镇', '嘉禾', '津市', '靖州', '江永',
                    '江华', '吉首', '剑河', '锦屏', '江口', '金沙', '金堂', '江油', '江安', '筠连',
                    '简阳', '井研', '夹江', '金阳', '九龙县', '九寨沟', '金川', '剑阁', '蕉岭', '金湾',
                    '江门', '江海', '揭阳', '揭西', '揭东', '晋宁', '剑川', '建水', '金平', '江川',
                    '景谷', '景东', '江城', '景洪', '金秀', '靖西', '九龙', '嘉义'
                ]
            },
            {
                capital: 'K',
                name: [
                    '开县', '克山', '克东', '康平', '宽甸', '开原', '科左中旗', '科左后旗',
                    '开鲁', '库伦', '克什克腾', '喀喇沁', '科右中旗', '科右前旗', '康保',
                    '宽城', '岢岚', '垦利', '克拉玛依', '库尔勒', '库车', '柯坪', '喀什',
                    '奎屯', '康马', '崆峒', '康县', '康乐', '开封', '昆山', '开化', '开阳',
                    '凯里', '开江', '康定', '开平', '昆明', '开远'
                ]
            },
            {
                capital: 'L',
                name: ['梁平', '龙江', '林口', '兰西', '林甸', '萝北', '梨树', '柳河', '辽源',
                    '临江', '辽中', '旅顺', '凌海', '辽阳', '辽阳县', '凌源', '凉城', '林西', '临河',
                    '孪井滩', '栾城', '灵寿', '鹿泉', '涞源', '蠡县', '涞水', '滦平', '隆化', '滦县',
                    '滦南', '乐亭', '廊坊', '临城', '隆尧', '临西', '临漳', '卢龙', '娄烦', '灵丘',
                    '灵石', '黎城', '潞城', '陵川', '临汾', '临猗', '吕梁', '离石', '临县', '岚县',
                    '柳林', '临潼', '蓝田', '礼泉', '洛川', '洛南', '岚皋', '略阳', '留坝', '麟游',
                    '陇县', '崂山', '莱西', '临淄', '临邑', '陵县', '乐陵', '莱州', '龙口', '莱阳',
                    '临朐', '梁山', '临沂', '兰陵', '临沭', '利津', '莱芜', '聊城', '临清', '轮台',
                    '洛浦', '拉萨', '林周', '拉孜', '浪卡子', '隆子', '洛扎', '林芝', '朗县', '洛隆',
                    '类乌齐', '乐都', '冷湖', '兰州', '陇西', '临洮', '灵台', '临泽', '礼县', '两当',
                    '临夏', '临潭', '碌曲', '灵武', '隆德', '林州', '鲁山', '罗山', '兰考', '洛阳',
                    '洛宁', '栾川', '鹿邑', '漯河', '临颍', '灵宝', '卢氏', '溧水', '六合', '涟水',
                    '连云港', '溧阳', '老河口', '梁子湖', '罗田', '利川', '来凤', '临安', '临海',
                    '路桥', '丽水', '龙泉', '兰溪', '龙游', '庐江', '灵璧', '临泉', '利辛', '来安',
                    '郎溪', '六安', '罗源', '连江', '荔城', '龙海', '龙岩', '连城', '庐山', '黎川',
                    '龙南', '乐平', '莲花', '芦溪', '浏阳', '醴陵', '耒阳', '临武', '澧县', '临澧',
                    '娄底', '冷水江', '涟源', '隆回', '临湘', '蓝山', '冷水滩', '泸溪', '龙山', '龙里',
                    '罗甸', '荔波', '雷山', '黎平', '六枝', '龙泉驿', '阆中', '邻水', '泸州', '泸县',
                    '隆昌', '乐至', '乐山', '凉山', '雷波', '芦山', '泸定', '炉霍', '理塘', '理县',
                    '罗江', '乐昌', '龙门', '雷州', '廉江', '连平', '龙川', '连南', '连州', '连山',
                    '罗定', '陆丰', '陆河', '禄劝', '绿春', '泸西', '陆良', '罗平', '龙陵', '禄丰',
                    '澜沧', '鲁甸', '临沧', '兰坪', '泸水', '六库', '丽江', '陇川', '梁河', '潞西',
                    '隆安', '龙州', '柳州', '柳城', '鹿寨', '柳江', '来宾', '龙胜', '临桂', '灵川',
                    '荔浦', '陆川', '隆林', '乐业', '凌云', '灵山', '罗城', '临高', '陵水', '乐东',
                    '路环岛'
                ]
            },
            {
                capital: 'M',
                name: [
                    '密云', '门头沟', '闵行', '木兰', '牡丹江', '穆棱', '明水', '漠河', '密山', '梅河口',
                    '满都拉', '莫力达瓦', '满洲里', '满城', '孟村', '米脂', '勉县', '眉县', '牟平',
                    '蒙阴', '莫索湾', '米泉', '玛纳斯', '木垒', '麦盖提', '墨玉', '民丰', '墨竹工卡',
                    '米林', '墨脱', '芒康', '民和', '玛多', '玛沁', '茫崖', '门源', '岷县', '民勤', '民乐',
                    '麦积', '玛曲', '孟津', '民权', '孟州', '渑池', '麻城', '茅箭', '马鞍山', '蒙城',
                    '明光', '闽清', '闽侯', '明溪', '汨罗', '麻阳', '湄潭', '麻江', '米易', '绵阳', '沐川',
                    '马边', '眉山', '木里', '冕宁', '美姑', '名山', '茂县', '马尔康', '绵竹', '梅州',
                    '梅县', '麻章', '茂名', '茂港', '弥渡', '弥勒', '蒙自', '马龙', '马关', '麻栗坡',
                    '牟定', '墨江', '孟连', '勐海', '勐腊', '马山', '蒙山', '苗栗'
                ]
            },
            {
                capital: 'N',
                name: [
                    '宁河', '南川', '讷河', '宁安', '嫩江', '农安', '奈曼', '宁城', '那仁宝力格',
                    '巴彦诺日公', '南皮', '内丘', '南和', '宁晋', '南宫', '宁武', '宁陕', '宁强',
                    '南郑', '宁津', '宁阳', '尼勒克', '尼木', '南木林', '聂拉木', '乃东', '那曲',
                    '尼玛', '聂荣', '囊谦', '宁县', '内黄', '南阳', '南召', '内乡', '宁陵', '南乐',
                    '南京', '南通', '南漳', '宁波', '宁海', '南陵', '宁国', '宁德', '南安', '南靖',
                    '宁化', '南平', '南昌', '南昌县', '南城', '南丰', '宁冈', '南康', '宁都', '宁乡',
                    '南岳', '南县', '宁远', '南明', '纳雍', '南充', '南部', '南江', '纳溪', '南溪',
                    '内江', '宁南', '若尔盖', '南雄', '南澳', '南海', '南涧', '南华', '宁洱', '怒江',
                    '宁蒗', '南宁', '宁明', '那坡', '南丹', '南沙', '南投'
                ]
            },
            {
                capital: 'O',
                name: []
            },
            {
                capital: 'P',
                name: [
                    '平谷', '浦东南汇', '彭水', '磐石', '普兰店', '盘锦', '盘山', '平山', '平泉',
                    '平乡', '平定', '平遥', '平顺', '蒲县', '平陆县', '平鲁', '偏关', '蒲城', '平利',
                    '平阴', '平度', '平原', '蓬莱', '平邑', '炮台', '皮山', '帕里', '普兰', '平安',
                    '平凉', '平川', '平罗', '彭阳', '平顶山', '濮阳', '平舆', '浦口', '沛县', '邳州',
                    '平湖', '平阳', '浦江', '磐安', '普陀', '潘集', '平潭', '屏南', '莆田', '平和',
                    '浦城', '彭泽', '鄱阳', '萍乡', '平江', '普定', '平坝', '平塘', '盘县', '普安',
                    '郫县', '蒲江', '彭州', '攀枝花', '平武', '蓬安', '蓬溪', '平昌', '屏山', '彭山',
                    '普格', '番禺', '平远', '坡头', '蓬江', '普宁', '屏边', '普洱', '凭祥', '平乐',
                    '平南', '平果', '浦北', '屏东'
                ]
            },
            {
                capital: 'Q',
                name: [
                    '青浦', '黔江', '綦江', '齐齐哈尔', '青冈', '庆安', '七台河', '乾安', '前郭',
                    '清原', '清水河', '青龙山', '曲阳', '清苑', '迁西', '迁安', '青县', '清河',
                    '邱县', '曲周', '秦皇岛', '青龙', '清徐', '祁县', '沁县', '沁源', '沁水',
                    '曲沃', '乾县', '千阳', '岐山', '青岛', '齐河', '庆云', '栖霞', '青州', '曲阜',
                    '奇台', '且末', '青河', '曲水', '琼结', '曲松', '曲麻莱', '祁连', '庆阳',
                    '庆城', '清水', '秦安', '青铜峡', '杞县', '沁阳', '淇县', '清丰', '确山',
                    '启东', '蕲春', '潜江', '青田', '庆元', '衢州', '衢江', '潜山', '祁门', '全椒',
                    '青阳', '泉州', '清流', '全南', '祁东', '祁阳', '清镇', '黔西', '晴隆', '邛崃',
                    '渠县', '犍为', '青神', '青川', '曲江', '清远', '清新', '曲靖', '丘北', '巧家',
                    '全州', '钦州', '琼中', '琼海'
                ]
            },
            {
                capital: 'R',
                name: [
                    '荣昌', '饶河', '容城', '任丘', '饶阳', '任县', '芮城', '荣成', '乳山',
                    '日照', '若羌', '日喀则', '仁布', '日土', '汝州', '汝阳', '汝南', '如皋',
                    '如东', '瑞安', '瑞昌', '瑞金', '汝城', '仁怀', '榕江', '仁和', '荣县',
                    '仁寿', '壤塘', '乳源', '仁化', '饶平', '瑞丽', '融安', '融水', '容县'
                ]
            },
            {
                capital: 'S',
                name: [
                    '顺义', '石景山', '上海', '松江', '石柱', '双城', '尚志', '绥芬河', '绥化', '绥棱',
                    '孙吴', '绥滨', '双鸭山', '双阳', '舒兰', '四平', '双辽', '松原', '沈阳', '绥中',
                    '赛罕', '商都', '四子王旗', '舍伯吐', '苏左旗', '苏右旗', '索伦', '石家庄', '深泽',
                    '顺平', '尚义', '三河', '肃宁', '深州', '沙河', '涉县', '寿阳', '朔州', '山阴',
                    '神池', '石楼', '三原', '神木', '绥德', '商洛', '商州', '商南', '山阳', '石泉',
                    '商河', '寿光', '泗水', '单县', '石岛', '莘县', '石河子', '鄯善', '和硕', '沙雅',
                    '莎车', '疏附', '疏勒', '沙湾', '萨嘎', '萨迦', '山南', '桑日', '索县', '双湖',
                    '申扎', '狮泉河', '肃南', '山丹', '肃北', '石嘴山', '上街', '石龙', '商城', '社旗',
                    '嵩县', '商丘', '睢县', '商水', '沈丘', '遂平', '上蔡', '三门峡', '陕县', '苏州',
                    '射阳', '睢宁', '宿迁', '沭阳', '泗阳', '泗洪', '宿豫', '石首', '松滋', '沙市', '三峡',
                    '十堰', '神农架', '随州', '沙洋', '绍兴', '上虞', '嵊州', '三门', '遂昌', '松阳',
                    '嵊泗', '宿松', '宿州', '泗县', '歙县', '濉溪', '寿县', '舒城', '石台', '寿宁', '石狮',
                    '上杭', '三明', '沙县', '顺昌', '邵武', '松溪', '上饶', '上饶县', '上高', '遂川',
                    '上犹', '石城', '上栗', '韶山', '苏仙', '石门', '双峰', '邵阳', '邵东', '绥宁',
                    '邵阳县', '桑植', '双牌', '绥阳', '三都', '施秉', '三穗', '思南', '石阡', '松桃',
                    '水城', '双流', '三台', '遂宁', '射洪', '石棉', '石渠', '色达', '松潘', '什邡', '韶关',
                    '始兴', '汕头', '深圳', '顺德', '三水', '四会', '遂溪', '汕尾', '石林', '嵩明', '石屏',
                    '师宗', '施甸', '双柏', '绥江', '水富', '双江', '上林', '三江', '上思', '三亚'
                ]
            },
            {
                capital: 'T',
                name: [
                    '通州', '天津', '潼南', '铜梁', '通河', '泰来', '汤原', '同江', '塔河',
                    '铁力', '图们', '通化', '通化县', '洮南', '通榆', '台安', '铁岭', '土左旗',
                    '托县', '土右旗', '通辽', '太仆寺', '图里河', '突泉', '头道湖', '唐县',
                    '唐山', '唐海', '太原', '天镇', '太谷', '屯留', '潼关', '太白', '铜川',
                    '泰安', '郯城', '台儿庄', '滕州', '天池', '吐鲁番', '托克逊', '铁干里克',
                    '塔中', '塔什库尔干', '特克斯', '塔城', '托里', '同仁', '同德', '天峻',
                    '通渭', '天祝', '天水', '陶乐', '同心', '汤阴', '唐河', '桐柏', '通许',
                    '台前', '太康', '太仓', '通州', '铜山', '泰州', '泰兴', '团风', '铁山',
                    '通城', '通山', '天门', '桐庐', '桐乡', '台州', '天台', '泰顺', '太湖',
                    '桐城', '太和', '屯溪', '天长', '铜陵', '铜陵县', '同安', '泰宁', '铜鼓',
                    '泰和', '桃源', '桃江', '通道', '桐梓', '台江', '天柱', '铜仁', '通川',
                    '通江', '天全', '台山', '太华山', '腾冲', '通海', '天等', '藤县', '田阳',
                    '田东', '田林', '天峨', '屯昌', '台北', '桃园', '台南', '台东', '台中'
                ]
            },
            {
                capital: 'W',
                name: [
                    '武清', '万盛', '万州', '巫溪', '巫山', '武隆', '五常', '望奎', '五大连池', '乌伊岭',
                    '五营', '汪清', '瓦房店', '武川', '乌海', '翁牛特', '乌审旗', '乌审召', '五原',
                    '乌前旗', '乌中旗', '乌后旗', '乌拉盖', '乌兰浩特', '乌斯太', '无极', '望都', '万全',
                    '围场', '文安', '吴桥', '武邑', '武强', '威县', '魏县', '武安', '武乡', '万荣', '闻喜',
                    '五台县', '五台山', '五寨', '文水', '武功', '吴起', '吴堡', '渭南', '武城', '潍坊',
                    '微山', '汶上', '无棣', '威海', '文登', '五莲', '乌鲁木齐', '乌鲁木齐牧试站', '乌尔禾',
                    '乌什', '温宿', '乌苏', '乌恰', '温泉', '乌兰', '渭源', '武威', '武山', '武都', '文县',
                    '吴忠', '卫辉', '舞钢', '尉氏', '武陟', '温县', '舞阳', '无锡', '吴中', '吴江', '武进',
                    '武汉', '武穴', '五峰', '温岭', '温州', '文成', '武义', '五河', '芜湖', '芜湖县', '无为',
                    '望江', '武平', '武夷山', '武宁', '婺源', '万年', '万载', '万安', '望城', '武冈', '武陵源',
                    '乌当', '务川', '瓮安', '万山', '威宁', '望谟', '温江', '万源', '武胜', '威远', '汶川',
                    '旺苍', '翁源', '武江', '五华', '吴川', '巍山', '文山', '武定', '威信', '维西', '武鸣',
                    '武宣', '梧州', '涠洲岛', '文昌', '万宁', '五指山'
                ]
            },
            {
                capital: 'X',
                name: [
                    '徐汇', '西青', '秀山', '逊克', '新林', '新民', '岫岩', '新宾', '西丰', '兴城',
                    '希拉穆仁', '兴和', '锡林浩特', '西乌旗', '镶黄旗', '小二沟', '新左旗', '新右旗',
                    '锡林高勒', '行唐', '辛集', '新乐', '徐水', '雄县', '宣化', '兴隆', '香河', '献县',
                    '邢台', '新河', '小店区', '昔阳', '襄垣', '隰县', '襄汾', '乡宁', '新绛', '夏县',
                    '忻州', '兴县', '孝义', '西安', '咸阳', '旬邑', '兴平', '旬阳', '西乡', '夏津',
                    '新泰', '薛城', '小渠子', '新和', '新源', '谢通门', '西宁', '循化', '兴海', '西和',
                    '夏河', '西吉', '荥阳', '新密', '新郑', '新乡', '许昌', '襄城', '信阳', '息县',
                    '新县', '西峡', '淅川', '新野', '新安', '夏邑', '修武', '浚县', '西华', '项城',
                    '西平', '新蔡', '锡山', '响水', '徐州', '新沂', '盱眙', '兴化', '新洲', '襄阳',
                    '襄州', '孝感', '孝昌', '浠水', '下陆', '西塞山', '咸宁', '兴山', '咸丰', '宣恩',
                    '仙桃', '萧山', '象山', '新昌', '仙居', '萧县', '休宁', '宣城', '厦门', '霞浦',
                    '仙游', '秀屿港', '秀屿', '新建', '星子', '修水', '新干', '峡江', '信丰', '寻乌',
                    '兴国', '湘东', '新余', '湘江新区', '湘潭', '湘乡', '新化', '新邵', '新宁', '湘阴',
                    '新晃', '溆浦', '新田', '息烽', '修文', '小河', '习水', '兴义', '兴仁', '新都',
                    '新津', '西充', '宣汉', '叙永', '兴文', '西昌', '喜德', '新龙', '乡城', '小金',
                    '新丰', '兴宁', '徐闻', '霞山', '新会', '新兴', '信宜', '寻甸', '祥云', '宣威',
                    '西畴', '新平', '西盟', '香格里拉', '忻城', '象州', '兴安', '兴业', '西林', '西沙',
                    '香港', '新界', '新竹'
                ]
            },
            {
                capital: 'Y',
                name: [
                    '延庆', '永川', '渝北', '云阳', '酉阳', '依兰', '延寿', '依安', '伊春', '友谊',
                    '榆树', '永吉', '延吉', '伊通', '义县', '营口', '伊和乌素', '伊金霍洛', '牙克石',
                    '雅布赖', '元氏', '易县', '蔚县', '阳原', '玉田', '永清', '盐山', '永年', '阳曲',
                    '阳高', '阳泉', '盂县', '榆次', '榆社', '阳城', '永和', '翼城', '运城', '垣曲',
                    '永济', '右玉', '应县', '原平', '永寿', '延安', '延长', '延川', '宜川', '榆林',
                    '榆阳', '洋县', '耀县', '宜君', '耀州', '杨凌', '沂源', '禹城', '烟台', '鱼台',
                    '兖州', '沂南', '沂水', '郓城', '阳信', '峄城', '阳谷', '尉犁', '焉耆', '英吉沙',
                    '叶城', '岳普湖', '伊宁', '伊宁县', '裕民', '伊吾', '于田', '亚东', '玉树', '永登',
                    '榆中', '永昌', '玉门', '永靖', '银川', '永宁', '盐池', '原阳', '延津', '鄢陵',
                    '禹州', '叶县', '宜阳', '伊川', '偃师', '虞城', '永城', '义马', '宜兴', '扬中',
                    '扬州', '仪征', '盐城', '盐都', '宜城', '云梦', '应城', '英山', '阳新', '宜昌',
                    '远安', '宜都', '夷陵', '郧西', '郧县', '余杭', '余姚', '鄞州', '玉环', '乐清',
                    '永嘉', '云和', '义乌', '永康', '岳西', '颍上', '黟县', '永泰', '永春', '云霄',
                    '永定', '尤溪', '永安', '永修', '余干', '弋阳', '铅山', '玉山', '宜黄', '宜春',
                    '宜丰', '永丰', '永新', '于都', '鹰潭', '余江', '攸县', '炎陵', '宜章', '永兴',
                    '益阳', '沅江', '岳阳', '沅陵', '永州', '永顺', '云岩', '余庆', '玉屏', '印江',
                    '沿河', '盐边', '盐亭', '营山', '仪陇', '岳池', '宜宾', '宜宾县', '盐源', '越西',
                    '雅安', '荥经', '雅江', '阳山', '英德', '云浮', '郁南', '云安', '阳江', '阳春',
                    '阳东', '阳西', '宜良', '云龙', '漾濞', '永平', '元阳', '砚山', '玉溪', '易门',
                    '元江', '元谋', '姚安', '永仁', '彝良', '永善', '盐津', '永德', '云县', '永胜',
                    '盈江', '邕宁', '永福', '阳朔', '玉林', '宜州', '宜兰', '云林'
                ]
            },
            {
                capital: 'Z',
                name: [
                    '忠县', '肇东', '肇州', '肇源', '镇赉', '庄河', '章党', '彰武', '卓资', '扎鲁特', '准格尔',
                    '朱日和', '正镶白旗', '正蓝旗', '扎兰屯', '扎赉特', '中泉子', '正定', '赞皇', '赵县',
                    '涿州', '张家口', '张北', '涿鹿', '遵化', '枣强', '左云', '左权', '长子', '泽州', '中阳',
                    '周至', '子长', '志丹', '子洲', '柞水', '镇安', '紫阳', '镇坪', '镇巴', '章丘', '淄博',
                    '淄川', '周村', '招远', '诸城', '邹城', '沾化', '邹平', '枣庄', '泽普', '昭苏', '仲巴',
                    '札囊', '泽当', '左贡', '札达', '泽库', '治多', '杂多', '漳县', '庄浪', '正宁', '镇原',
                    '张掖', '张家川', '卓尼', '舟曲', '中卫', '中宁', '郑州', '中牟', '镇平', '柘城', '周口',
                    '驻马店', '正阳', '镇江', '张家港', '枣阳', '秭归', '枝江', '竹溪', '竹山', '张湾', '钟祥',
                    '镇海', '诸暨', '舟山', '枞阳', '周宁', '柘荣', '漳州', '漳浦', '诏安', '漳平', '政和',
                    '资溪', '樟树', '株洲', '资兴', '张家界', '芷江', '中方', '遵义', '遵义县', '正安', '镇宁',
                    '紫云', '镇远', '织金', '贞丰', '自贡', '梓潼', '资中', '资阳', '昭觉', '中江', '增城',
                    '浈江', '珠海', '肇庆', '湛江', '紫金', '中山', '沾益', '镇沅', '昭通', '镇雄', '镇康',
                    '中甸', '资源', '昭平', '钟山', '中沙', '彰化'
                ]
            }
        ],
        Capital: ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'W', 'X', 'Y', 'Z'],
        isRout: true,
        keyWord: '',
    },
    methods: {
        CityId(i) {
            return this.City[i].capital
        },
        selectMenu(id) {
            const returnEle = document.querySelector('#' + id)
            returnEle.scrollIntoView(true)
        },
        getCity(e) {
            const val = document.getElementById('inputval')
            this.keyWord = e.target.innerText
            val.scrollIntoView(true)
        },
        onfocus() {
            this.isRout = !this.isRout
        },
        onblur() {
            this.isRout = !this.isRout
        }
    },
    computed: {
        filPersons() {
            if (this.keyWord === '') return this.hot
            let pushname = []
            for (let index = 0; index < this.City.length; index++) {
                pushname = pushname.concat(this.City[index].name)
            }
            return pushname.filter((p) => {
                return p.indexOf(this.keyWord) !== -1
            })
        }
    }
})